deployments/istio-kserve/pattern1-baseline/benchmarks/results/cluster/ab_1req_1c_20260210_150651.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 34.7.208.8 (be patient).....done


Server Software:        istio-envoy
Server Hostname:        34.7.208.8
Server Port:            80

Document Path:          /llm-d-inference-scheduling/qwen2-3b-pattern1/v1/completions
Document Length:        16 bytes

Concurrency Level:      1
Time taken for tests:   1.419 seconds
Complete requests:      1
Failed requests:        0
Non-2xx responses:      1
Total transferred:      172 bytes
Total body sent:        333
HTML transferred:       16 bytes
Requests per second:    0.70 [#/sec] (mean)
Time per request:       1418.598 [ms] (mean)
Time per request:       1418.598 [ms] (mean, across all concurrent requests)
Transfer rate:          0.12 [Kbytes/sec] received
                        0.23 kb/s sent
                        0.35 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      190  190   0.0    190     190
Processing:  1229 1229   0.0   1229    1229
Waiting:      207  207   0.0    207     207
Total:       1419 1419   0.0   1419    1419