deployments/istio-kserve/pattern1-baseline/benchmarks/results/cluster/ab_20req_5c_20260210_150651.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 34.7.208.8 (be patient).....done


Server Software:        istio-envoy
Server Hostname:        34.7.208.8
Server Port:            80

Document Path:          /llm-d-inference-scheduling/qwen2-3b-pattern1/v1/completions
Document Length:        16 bytes

Concurrency Level:      5
Time taken for tests:   5.661 seconds
Complete requests:      20
Failed requests:        0
Non-2xx responses:      20
Total transferred:      3440 bytes
Total body sent:        6660
HTML transferred:       320 bytes
Requests per second:    3.53 [#/sec] (mean)
Time per request:       1415.226 [ms] (mean)
Time per request:       283.045 [ms] (mean, across all concurrent requests)
Transfer rate:          0.59 [Kbytes/sec] received
                        1.15 kb/s sent
                        1.74 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      142  167  28.7    150     219
Processing:  1146 1156  17.6   1152    1228
Waiting:      146  183  35.1    204     238
Total:       1288 1323  40.5   1304    1447

Percentage of the requests served within a certain time (ms)
  50%   1304
  66%   1339
  75%   1357
  80%   1357
  90%   1371
  95%   1447
  98%   1447
  99%   1447
 100%   1447 (longest request)